app/controllers/questions_controller.rb

SELECT * FROM "questions"
---
  def index
    @question = @current_user.questions.build

    if params[:question].nil?
      @questions = Question.all

SELECT * FROM "questions" WHERE ("questions"."id" = 6)
---
  def show
    @question = Question.find(params[:id])

INSERT INTO "questions" ("section", "created_at", "chapter", "updated_at", "question_number", "page_number", "question", "book_id") VALUES(NULL, '2010-05-16 12:37:23', NULL, '2010-05-16 12:37:23', NULL, NULL, NULL, 1)
---
  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save